Revit 2027 API
TabbedDialogExtension.GetContextualHelp Method
Gets the contextual help.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContextualHelp GetContextualHelp()
Public Function GetContextualHelp As ContextualHelp
public:
ContextualHelp^ GetContextualHelp()
member GetContextualHelp : unit -> ContextualHelp
Return Value
ContextualHelp
The contextual help assigned to the help button of the Revit options dialog, or null if there is no binding assigned.
See Also
Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace